prodic={"11":"北京","22":"吉林","35":"福建","44":"广东",
        "53":"云南","12":"天津","23":"黑龙江","36":"江西",
        "45":"广西","54":"西藏","13":"河北","31":"上海",
        "37":"山东","46":"海南","61":"陕西","14":"山西",
        "32":"江苏","41":"河南","50":"重庆","62":"甘肃",
        "15":"内蒙古","33":"浙江","42":"湖北","51":"四川",
        "63":"青海","21":"辽宁","34":"安徽","43":"湖南",
        "52":"贵州","64":"宁夏","65":"新疆","71":"台湾",
        "81":"香港","82":"澳门","91":"国外"}

people=input("请输入18位身份证号码")
if people%2==0:
        s="先生"
else:
        s="女士"


print("你好，{}，你的出生地在{}。出生日期为{}年{}月{}日".format(s,prodic.get(people[0:2],people[6:10],people[11],people[13])))
