#符合字典语法的字符串
str="{'股票名称': '福建高速', '今开': '3.32', '成交量': '5.37万手', '最高': '3.34', '涨停': '3.66', '内盘': '4.03万手', '成交额': '1778.96万', '委比': '-18.43%', '流通市值': '90.29亿', '市盈率MRQ '11.34', '每股收益': '0.07', '总股本': '27.44亿', '昨收': '3.33', '换手率': '0.20%', '最低': '3.28', '跌停': '3.00', '外盘': '1.34万手', '振幅': '1.80%', '量比': '0.52', '总市值': '90.29亿', '市净率': '0.96', '每股净资产': '3.43', '流通股本': '27.44亿'}"
#使用eval表达式求值
d3=eval(str)
print(d3.key())

import json
#符合字典语法的字符串,json格式键必须用双引号
str2='{"name":"zhangsan","age":13}'

#使用json包loads()函数
d4=json.loads(str2)
print(d4.keys())



